In [1]:
import json
import pandas as pd
import mysql.connector
from mysql.connector import errorcode
import re

In [25]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab', host='127.0.0.1', database='sakila')

In [26]:
mycursor = cnx.cursor()

In [4]:
with open("bda-modulo-2-evaluacion-final-marianela-gomez/exercise_script.sql", "r", encoding="utf-8") as file:
    sql_script = file.read()

In [5]:
clean_queries = []
     
for query in sql_script.split(";"):
    query = query.strip()
    
    if '--' not in query:
        clean_queries.append(query)
    if '#' in query:
        query = re.sub(r'\s#+\s[A-Z]\s[A-Z]\s[A-Z]\s[A-Z]\s[A-Z]\s#+\s#+', '', query)
        query = re.sub(r'#', '', query)
        clean_queries.append(query)
    if '--' in query:
        query = re.sub(r'--.+', '', query.strip())
        clean_queries.append(query)
    if '/*' in query:
        query = re.sub(r'\s+\/\*\s.*\s.+[a-zA-Z]+.+\s+[a-zA-Z].+\s+[a-zA-Z].+\s+[a-zA-Z].+\s+[a-zA-Z].+\s+[a-zA-Z].+', '', query)
        clean_queries.append(query)

In [6]:
clean_queries

['USE sakila',
 '\n\nSELECT DISTINCT lower(title) AS film_title\n\tFROM film',
 '\n\nSELECT lower(title) AS film_title\n\tFROM film \n    WHERE rating = "PG-13"',
 '\n\nSELECT lower(title) AS film_title, lower(description)\n\tFROM film \n    WHERE description LIKE ("%amazing%")',
 '\n\nSELECT lower(title) AS film_title\n\tFROM film \n    WHERE length > 120',
 '\n\nSELECT lower(first_name) AS actor_name\n\tFROM actor',
 '\n\nSELECT CONCAT(lower(first_name), " ", lower(last_name)) AS actor_name\n\tFROM actor\n    WHERE last_name LIKE ("Gibson")',
 '\n    \nSELECT lower(first_name) AS actor_name\n\tFROM actor\n    WHERE actor_id BETWEEN 10 AND 20',
 '\n\nSELECT lower(title) AS film_title\n\tFROM film \n    WHERE rating NOT IN ("R", "PG-13")',
 '\n\nSELECT rating, COUNT(rating) AS num_of_films\n\tFROM film\n    GROUP BY rating',
 '\n\nSELECT CONCAT(lower(c.first_name), " ", lower(c.last_name)) AS customer_name, COUNT(c.customer_id) AS rented_films\n\tFROM customer AS c\n    INNER JOIN rental AS r\n    USING (customer_id)\n    GROUP BY c.customer_id',
 '\n\nSELECT c.name AS category, COUNT(fc.category_id) AS rented_films\n\tFROM rental AS r\n    INNER JOIN inventory AS i\n    USING (inventory_id)\n    INNER JOIN film_category AS fc\n    USING (film_id)\n    INNER JOIN category as c\n    USING(category_id)\n    GROUP BY fc.category_id',
 '\n\nSELECT rating, ROUND(AVG(length),2) AS length_in_min\n\tFROM film\n    GROUP BY rating',
 '\n\nSELECT CONCAT(lower(first_name), " ", lower(last_name)) AS actor_name\n\tFROM actor AS a\n    INNER JOIN film_actor AS fa\n    USING (actor_id)\n    INNER JOIN film AS f\n    USING(film_id)\n    WHERE f.title = "Indian Love"',
 '\n\nSELECT lower(title) AS film_title\n\tFROM film\n    WHERE description LIKE ("%dog%") OR description LIKE ("%cat%")',
 '\n\n/* En principio, la tabla intermedia y la relacion entre film y actor debería evitar esto. En cualquier caso, si hubiera alguno, aparecería con */\n\nSELECT * \n\tFROM film_actor\n    WHERE film_id IS NULL',
 '',
 '\n\nSELECT lower(title) AS film_title, release_year\n\tFROM film\n    WHERE release_year BETWEEN 2005 AND 2010',
 '\n\nSELECT lower(f.title) AS film_title\n\tFROM film as f\n    INNER JOIN film_category AS fc\n    USING (film_id)\n    WHERE category_id = (\n\t\t\t\t\t\tSELECT category_id\n\t\t\t\t\t\t\tFROM category\n\t\t\t\t\t\t\tWHERE name = "Family"\n    )',
 '\n\nSELECT CONCAT(lower(a.first_name), " ", lower(a.last_name)) AS actor_name\n\tFROM actor AS a\n    INNER JOIN film_actor AS fa\n    USING (actor_id)\n    GROUP BY actor_name\n    HAVING COUNT(fa.film_id) > 10',
 '\n\nSELECT lower(title)\n\tFROM film\n    WHERE rating = "R" AND length > 120',
 '\n\nSELECT c.name, ROUND(AVG(length), 2) AS avg_length_in_min\n\tFROM category AS c\n    INNER JOIN film_category AS fc\n    USING (category_id)\n    INNER JOIN film AS f\n    USING (film_id)\n    GROUP BY (c.name)\n    HAVING AVG(length) > 120',
 '\n\n\nWITH actors_in_films AS (\n\t\t\t\t\t\tSELECT CONCAT(lower(a.first_name), " ", lower(a.last_name)) AS actor_name, COUNT(fa.actor_id) AS num_of_films\n\t\t\t\t\t\t\tFROM actor AS a\n                            INNER JOIN film_actor AS fa\n                            USING (actor_id)\n                            GROUP BY (fa.actor_id))\n\t\t\t\t\t\nSELECT actor_name, num_of_films\n\tFROM actors_in_films\n\tWHERE num_of_films > 5',
 '\n\n\nSELECT DISTINCT lower(f.title) AS film_title\n\tFROM rental AS r\n    INNER JOIN inventory AS i\n    USING (inventory_id)\n    INNER JOIN film AS f\n    USING (film_id)\n    WHERE r.rental_id IN (\n\t\t\t\t\t\t\tSELECT rental_id\n\t\t\t\t\t\t\tFROM rental\n\t\t\t\t\t\t\tWHERE TIMESTAMPDIFF(DAY, rental_date, return_date) > 5\n)',
 '\n\n\nWITH actors_in_horror AS (\n\t\t\t\t\t\tSELECT DISTINCT CONCAT(lower(a.first_name), " ", lower(a.last_name)) AS actor_name\n\t\t\t\t\t\t\tFROM actor as a\n\t\t\t\t\t\t\tINNER JOIN film_actor AS fm\n\t\t\t\t\t\t\tUSING (actor_id)\n\t\t\t\t\t\t\tINNER JOIN film_category AS fc\n\t\t\t\t\t\t\tUSING (film_id)\n\t\t\t\t\t\t\tINNER JOIN category AS c\n\t\t\t\t\t\t\tUSING (category_id)\n\t\t\t\t\t\t\tWHERE c.name = "Horror")\n    \nSELECT CONCAT(lower(a.first_name), " ", lower(a.last_name)) AS actor_name\n\tFROM actor AS a\n    WHERE CONCAT(lower(a.first_name), " ", lower(a.last_name)) NOT IN ( SELECT actor_name FROM actors_in_horror)',
 '\n\nSELECT lower(title) AS film\n\tFROM film AS f\n    INNER JOIN film_category AS fm\n    USING (film_id)\n    INNER JOIN category AS c\n    USING(category_id)\n    WHERE c.name = "Comedy" AND f.length > 180',
 '\n\n-- Encuentra todos los actores que han actuado juntos en al menos una película. \n-- La consulta debe mostrar el nombre y apellido de los actores y el número de películas en las que han actuado juntos.\n\n/* Primero: ver los actores que comparten film_id en film_actor. \n\tSe hace un self join cuando fa1.film_id = fa2.film_id y para evitar duplicados, se une solo si fa1.actor_id < fa2.actor_id. \n    Así, si el 1 y el 10 están en la misma peli, cuenta solo cuando actor1 es 1 y actor2 es 10.\n    \n    Segundo: Agrupar por pares de actores que comparten el film_id. \n\t\tAsí podemos contar los film_id en las que aparecen juntos.\n        \n\tTercero: Mostrar el nombre de los actores. \n\t\tComo se ha hecho un self join, habrá que hacer un join a cada film_actor para poder mostrar los nombres de actor1 y actor2*/\n    \nSELECT CONCAT(lower(a1.first_name), " ", lower(a1.last_name)) AS actor_1, CONCAT(lower(a2.first_name), " ", lower(a2.last_name)) AS actor_2, COUNT(fa1.film_id) AS films_together\n\tFROM film_actor AS fa1\n    INNER JOIN film_actor AS fa2\n    ON fa1.film_id = fa2.film_id\n    AND fa1.actor_id < fa2.actor_id\n    INNER JOIN actor AS a1\n    ON fa1.actor_id = a1.actor_id\n    INNER JOIN actor AS a2\n    ON fa2.actor_id = a2.actor_id\n    GROUP BY actor_1, actor_2',
 '\n\n\n/* Primero: ver los actores que comparten film_id en film_actor. \n\tSe hace un self join cuando fa1.film_id = fa2.film_id y para evitar duplicados, se une solo si fa1.actor_id < fa2.actor_id. \n    Así, si el 1 y el 10 están en la misma peli, cuenta solo cuando actor1 es 1 y actor2 es 10.\n    \n    Segundo: Agrupar por pares de actores que comparten el film_id. \n\t\tAsí podemos contar los film_id en las que aparecen juntos.\n        \n\tTercero: Mostrar el nombre de los actores. \n\t\tComo se ha hecho un self join, habrá que hacer un join a cada film_actor para poder mostrar los nombres de actor1 y actor2*/\n    \nSELECT CONCAT(lower(a1.first_name), " ", lower(a1.last_name)) AS actor_1, CONCAT(lower(a2.first_name), " ", lower(a2.last_name)) AS actor_2, COUNT(fa1.film_id) AS films_together\n\tFROM film_actor AS fa1\n    INNER JOIN film_actor AS fa2\n    ON fa1.film_id = fa2.film_id\n    AND fa1.actor_id < fa2.actor_id\n    INNER JOIN actor AS a1\n    ON fa1.actor_id = a1.actor_id\n    INNER JOIN actor AS a2\n    ON fa2.actor_id = a2.actor_id\n    GROUP BY actor_1, actor_2',
 '\n    \nSELECT CONCAT(lower(a1.first_name), " ", lower(a1.last_name)) AS actor_1, CONCAT(lower(a2.first_name), " ", lower(a2.last_name)) AS actor_2, COUNT(fa1.film_id) AS films_together\n\tFROM film_actor AS fa1\n    INNER JOIN film_actor AS fa2\n    ON fa1.film_id = fa2.film_id\n    AND fa1.actor_id < fa2.actor_id\n    INNER JOIN actor AS a1\n    ON fa1.actor_id = a1.actor_id\n    INNER JOIN actor AS a2\n    ON fa2.actor_id = a2.actor_id\n    GROUP BY actor_1, actor_2',
 '']

In [8]:
for query in clean_queries:
    if "" == query:
        clean_queries.remove(query)
    if "--" in query:
        clean_queries.remove(query)
    if "/*" in query:
        clean_queries.remove(query)

In [9]:
len(clean_queries)

25

In [31]:
results = []
for query in clean_queries:
    mycursor.execute(query)
    results.append(mycursor.fetchall())

In [41]:
df = pd.DataFrame(results[-1])

In [43]:
df.sample(10)

                    0                1  2
3852      tom miranda   matthew carrey  2
4733      mena temple      fay winslet  1
4208  parker goldberg      will wilson  1
3548     goldie brody    ellen presley  1
9047   daryl crawford  morgan williams  2
9681        emily dee      mena hopper  1
6599   scarlett damon        jon chase  3
847         joe swank   kirsten akroyd  1
9419     ewan gooding        jon chase  1
5639    angela hudson      harvey hope  1

In [46]:
df_2 = pd.read_sql_query(clean_queries[-1], cnx)

C:\Users\maria\AppData\Local\Temp\ipykernel_24612\1034347106.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_2 = pd.read_sql_query(clean_queries[-1], cnx)

In [47]:
df_2.sample(10)

              actor_1           actor_2  films_together
2258   cameron streep  groucho williams               1
1878    lucille tracy     minnie kilmer               1
7537      gene willis       renee tracy               1
1302    vivien bergen       whoopi hurt               2
4287  julia barrymore       harvey hope               1
3516     tom mckellen       mary keitel               1
186          ed chase          uma wood               3
1359    vivien bergen     gene mckellen               1
1558     fred costner        reese west               2
1223         uma wood       tim hackman               1